Repository: ash9995/thoughts
Catalog: thoughts/*.lproj/Localizable.strings
Languages: ar

source: Raheeb provides questions that help you explore and understand the roots of negative thoughts in your mind. Join us on the journey of improving your thinking and changing negativity into positivity, to achieve a happier and more balanced life.
ar: رحيب يقدم أسئلة تساعدك في استكشاف وفهم جذور الأفكار السلبية في ذهنك. انضم إلينا في رحلة تحسين تفكيرك وتغيير السلبية إلى إيجابية، لتحقيق حياة أكثر سعادة وتوازنًا.

source: start
ar: ابدا

source: Add what you have inside
ar: اضف ما بداخلك

source: My thoughts
ar: افكاري

source: add your thoughts
ar: اضف الفكره

source: thought title
ar: عنوان الفكره

source: cancele
ar: الغاء

source: save
ar: حفظ

source: record
ar: سجل

source: stop recording
ar: ايقاف

source: What happened to make me think this way?
ar: ما الذي حدث ليجعلني أفكر بهذا التفكير؟

source: how do you feel today?
ar: كيف تشعر اليوم؟

source: What was my reaction?
ar: ماذا كان ردت فعلي؟

source: What makes me think this thought is true?
ar: ما الذي يجعلني أعتقد أن هذا الفكر صحيح؟

source: Is there any evidence to suggest that this idea is incorrect?
ar: هل توجد أي أدلة تشير إلى أن هذه الفكرة غير صحيحة؟

source: If this idea is correct, what supports the validity of this idea?
ar: اذا كانت هذه الفكره صحيحه ما الذي يدعم صحه هذا الفكرة ؟

source: Balanced idea
ar: الفكرة المتوازنه
